<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.78 [de] (X11; U; Linux 2.4.10-4GB i686) [Netscape]">
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#0000FF" vlink="#9E0061" alink="#FF0000">

<h2>
Bediener-Kurzleitfaden zum Transcriber</h2>

<h4>
Was ist eine Transkription</h4>
Eine Transkription ist die orthografische Verschriftung einer Audiodatei.
Das Audio wird als eine Sammlung kurzer Audiosegmente betrachtet, die durch
Synchronisationshaltepunkte getrennt sind. Jeder Sprecherwechsel markiert
den Beginn einer neuen Sprechersequenz. Die Sprechersequenzen selbst gruppieren
sich in homogene Abschnitte &uuml;ber verschiedene Themen.
<h3>
Eine typische Transkriptionssitzung</h3>

<h4>
Start einer Sitzung</h4>

<ul>
<li>
Um eine neue Transkription zu starten, Men&uuml; File/New trans w&auml;hlen.
Das Programm fragt Sie nach dem zu transkribierenden Signal. Diese Wahl
kann sp&auml;ter &uuml;ber das Men&uuml; File/Open audio file ... ge&auml;ndert
werden.</li>

<li>
Speichern Sie Ihre Arbeit regelm&auml;&szlig;ig &uuml;ber das Men&uuml;
File/Save speichern. Wird eine neue Transkription zum ersten Mal gespeichert,
wird dem Nutzer ein mit dem Signalnamen identischer Name vorgeschlagen
(aber mit einer anderen Erweiterung, abh&auml;ngig von dem gew&auml;hlten
Format. Geben Sie diese Erweiterung nicht manuell ein!).</li>

<li>
Soll eine vorhandene Transkription bearbeitet werden, &ouml;ffnen Sie diese
&uuml;ber das Men&uuml; File/Open trans .... Der Transcriber sucht nach
dem Signal, das denselben Namen hat wie die Transkription. Findet das Programm
dieses Signal nicht, werden Sie aufgefordert, in einem Dialogfeld den Signalort
anzugeben.</li>
</ul>
Wenn Sie die Konfiguration vor Verlassen &uuml;ber das Men&uuml; Options/Save
configuration speichern, werden sowohl die Audio- als auch die Transkriptionsdatei
beim n&auml;chsten Start des Transcribers automatisch ge&ouml;ffnet.
<h4>
Anh&ouml;ren des Signals</h4>
Das Signal kann mit der Maus (Bildlaufleisten, Schaltfl&auml;chen), &uuml;ber
Men&uuml;s oder mit Tasten-Shortcuts gehandhabt werden. ,Tab'-Taste f&uuml;r
Start der Wiedergabe bzw. Pause verwenden.
<h4>
Erster Schritt: Grobsegmentierung</h4>

<ul>
<li>
Eine Aufl&ouml;sung von 30 s oder weniger f&uuml;r das Signal w&auml;hlen.</li>

<li>
Wiedergabe am Beginn der Datei starten (bzw. am Beginn des noch nicht transkribierten
Teils des Signals).</li>

<li>
W&auml;hrend der Wiedergabe mit der ,Enter'-Taste immer dann einen neuen
Haltepunkt einf&uuml;gen, wenn kurze Sprechpausen oder &Auml;nderungen
im Hintergrund wahrgenommen werden. Im Text erscheint eine neue Zeile mit
einem Punkt, und unter dem Signal wird an der Cursorposition ein Balken
sichtbar.</li>

<li>
Nach ein paar Minuten Grobsegmentierung sollte eine Folge von Segmenten
von jeweils 10 bis 30 s Dauer vorliegen.</li>

<li>
Nicht vergessen, die Arbeit regelm&auml;&szlig;ig zu speichern (Men&uuml;
File/Save).</li>
</ul>
<b>Zweiter Schritt: Transkription</b>
<ul>
<li>
Eine Aufl&ouml;sung von 10 s oder weniger f&uuml;r das Signal w&auml;hlen.</li>

<li>
Durch Anklicken der ersten Zeile des Textes oder des Signalbeginns zum
ersten nicht transkribierten Segment zur&uuml;ckgehen.</li>

<li>
Das Segment anh&ouml;ren (Men&uuml; Signal/Replay segment).</li>

<li>
Falls erforderlich, die Segmentgrenzen durch Klicken auf die betreffende
Grenze mit Maustaste 2 und Ziehen der Maus anpassen.</li>

<li>
F&auml;ngt zu Beginn des aktuellen Segments ein neuer Sprecher zu reden
an, das als neue Sprechersequenz markieren (Men&uuml; Segmentation/Change
segment type/Turn oder mit entsprechendem Shortcut). Sie werden nach dem
Namen des Sprechers gefragt, k&ouml;nnen aber die defaultm&auml;&szlig;ige
Einstellung (New Speaker) beibehalten und sp&auml;ter &auml;ndern, wenn
Sie das m&ouml;chten.</li>

<li>
Transkription eintippen. Sie erscheint automatisch im Texteditor und in
der Segmentierung unter dem Signal.</li>

<li>
Auf die gleiche Weise alle verbleibenden Segmente bearbeiten.</li>
</ul>

<h4>
Dritter Schritt: &Uuml;berpr&uuml;fung</h4>

<ul>
<li>
Gehen Sie zur&uuml;ck und h&ouml;ren Sie sich w&auml;hrend des Lesens der
Transkription das Signal an. Starten und unterbrechen Sie die Wiedergabe
so oft wie n&ouml;tig (mit der ,Tab'-Taste). W&auml;hrend der Wiedergabe
k&ouml;nnen Sie vor- und zur&uuml;ckgehen.</li>

<li>
Gliedern Sie das Dokument auf globaler Ebene durch Markieren neuer Abschnitte
(Men&uuml; Segmentation/Change segment type/Section oder mit entsprechendem
Shortcut). Abschnittstypen sind ,report', ,filler' oder ,notrans'. Dem
Abschnitt kann ein willk&uuml;rliches Thema zugeordnet werden.</li>

<li>
Transkribierter Text kann im Textfenster ge&auml;ndert werden. Sprechernamen
und Themen k&ouml;nnen &uuml;ber das Men&uuml; Segmentation/Edit attributes
... oder direkt durch Klicken auf die betreffenden Schaltfl&auml;che im
Textfenster modifiziert werden.</li>
</ul>

</body>
</html>
